#include <stdio.h>
#include <string.h>

#include "pspsdk.h"
#include "pspkernel.h"
#include "psptypes.h"

#include "systemctrl.h"
#include "kubridge.h"

#include "log.h"

#define MAKE_CALL(__f) \
	(((((unsigned int)__f) >> 2) & 0x03FFFFFF) | 0x0C000000)

#define MAKE_BREAK(n) ((((u32)n << 6) & 0x03FFFFC0) | 0x0000000D)

PSP_MODULE_INFO("lftv_patch_module", 0, 1, 0);

char *reg_table[] = {
	"zr", "at",
	"v0", "v1",
	"a0", "a1", "a2", "a3",
	"t0", "t1", "t2", "t3", "t4", "t5", "t6", "t7",
	"s0", "s1", "s2", "s3", "s4", "s5", "s6", "s7",
	"t8", "t9",
	"k0", "k1",
	"gp",
	"sp",
	"fp",
	"ra"
};

static u32
ator(char *r)
{
	u32 i;

	for (i = 0; i < sizeof(reg_table) / sizeof(char *); i++) {
		if (strcmp(r, reg_table[i]) == 0)
			return i;
	}

	return 0;
}

/* val - our hook func
 * addr - start addr of patch
 * r0   - the register to be set (usually a0/a1...)
 * r1   - the utility register (usually v0/v1...)
 */
static void
patch_load_value(u32 val, u32 addr_hi, u32 addr_lo, char *r0, char *r1)
{
	u32 hi, lo;

	/* hi is lui r1, val >> 16 */
	hi = 0x3C000000 | (ator(r1) << 16);
	hi |= val >> 16;

	/* lo is addiu r0, val & 0xFFFF */
	lo = 0x24000000 | (ator(r0) << 16);
	lo |= ator(r1) << 21;
	lo |= val & 0xFFFF;

	/* then write hi and lo to addr */
	sctrlPatchModule("sceVshLftvMw_Module", hi, addr_hi);
	sctrlPatchModule("sceVshLftvMw_Module", lo, addr_lo);
}

struct rtp_1 {
	void *func_table; //0x0 table at 0x000592A0
	char *data; //0x4
	u32 len; //0x8
	u8 flag; //0xC
	u32 offset; //0x10
};


static u32 g_payload_c = 0; /* set in 00007B7C */

static void
print_payload(void)
{
	u32 pc = g_payload_c;

	if (pc == 0) {
		logstr("XXXXXXXX");
		return;
	}
	logstr("payload:");
	logint(pc);
	pc = _lw(0x58+pc);
	if (pc == 0) {
		logstr("0x58");
		return;
	}
	pc = _lw(0x24+pc);
	if (pc == 0) {
		logstr("0x24");
		return;
	}
	pc = _lw(0xC+pc);
	if (pc == 0) {
		logstr("0xC");
		return;
	}
	logint(_lw(0xC+pc));
	logint(_lw(0x10+pc));
	logint(_lw(0x14+pc));
	logint(_lw(0x18+pc));
}

#if 0
// size 0x30
struct rtp_1_cc {
	void *func_table; //0x0
	u32 ; //0x4
	u32 ; //0x8
	u8 ; //0xC
	u8 ; //0xD
	u32 ; //0x10
	u8 ; //0x14
	u32 ; //0x18
	u32 ; //0x1C
	u8 ; //0x20
	struct rtp_1_c; //0x24
};

// size 0xC
struct rtp_1_c {
	u32 next??;//0x0
	u32 ;//0x4
	struct rtp_1 *;//0x8
};

#endif

/* for sub_00014C34 only */
static inline u32 sema_id(u32 a0)
{
	return _lw(0x4+(_lw(0x20+a0)));
}

static void
print_sema(u32 sid)
{
	SceKernelSemaInfo info;

	info.name[0] = '\0';

	if (sceKernelReferSemaStatus(sid, &info) < 0) {
		logstr("print_sema error");
		return;
	}

	logstr("sema:");
	logint(sid);
	//logint(info.numWaitThreads);
	//logint(info.initCount);
	//logint(info.currentCount);
	//logint(info.maxCount);
	logstr(info.name);
	logstr("sema done");
}

static u32 g_text_addr = 0;

static u32
get_text_addr(u32 offset)
{

	if (g_text_addr == 0) {
		g_text_addr = sctrlModuleTextAddr("sceVshLftvMw_Module");
		if (g_text_addr == 0)
			return 0;
		logstr("text_addr:");
		logint(g_text_addr);
	}

	return g_text_addr + offset;
}

#define load_text_addr(__func, __offset, __ret) do {\
	if ((__func) == NULL) {\
		(__func) = (void *) get_text_addr((__offset));\
		if ((__func) == NULL)\
